src/main/resources/requests/allUserRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns="http://service.gpm.my.id/xmltesting">
    <soap:Header/>
    <soap:Body>
        <getAllUserRequest/>
    </soap:Body>
</soap:Envelope>